[
    {
      "text": "Context: - molArr[] is an array that keeps track of all of the molecules present on the screen. They are in order of when they are added.- displayReaction(reaction, lineNumber) visually displays a chemical reaction.- addElectronPusher(molArr[i], molArr[i], input1, input2) adds an electron pusher to the screen         - inputs1 and 2 are strings. They represent the atom# or the bond#. Input1 correlates to the first molArr[i] input. Input2 correlates to the second molArr[i], each representing either different or the same molecule. For example, in CCCCCC, the first “C” would be atom1. The final bond written from the smiles would be bond1. The bond[#] depends on the order of the elements in the smiles depicted in each molecule of displayReaction(). Hydrogens are not included in counting. For example, in OH-, O would be “atom1.”- addSideParticipant(molArr[i], smiles) adds the molecule depicted by the smiles right next to molArr[i]. This is used for mechanisms in which the species do not directly participate in the reaction, and is not often used.- If you need to DISPLAY an explicit hydrogen, then put the hydrogen in parentheses, like “(H)”. This is good for acids and for other reactions. For example, you would need to write “Br(H)” to display the Br-H bond.- display the atom where the electrons are going first. In this code, the atoms appear visually inverse to what they appear in the input string. For this reason, if an arrow is pointing from the right.\n\nONLY OUTPUT THE CODE"
    },
    {
      "text": "CBr + [OH-]"
    },
    {
      "text": "displayReaction(\"CBr + [OH-] -> CO + [Br-]\", 1); \naddElectronPusher(molArr[1], molArr[0], \"atom1\", \"atom1\");\naddElectronPusher(molArr[0], molArr[0], \"bond1\", \"atom2\");"
    },
    {
      "text": "CCBr + [OH-]"
    },
    {
      "text": "displayReaction(\"CCBr + [OH-] -> CCO + [Br-]\", 1);\naddElectronPusher(molArr[1], molArr[0], \"atom1\", \"atom2\");\naddElectronPusher(molArr[0], molArr[0], \"bond2\", \"atom3\");"
    },
    {
      "text": "CCCBr + [OH-]"
    },
    {
      "text": "displayReaction(\"CCCBr + [OH-] -> CCCO + [Br-]\", 1);\naddElectronPusher(molArr[1], molArr[0], \"atom1\", \"atom3\");\naddElectronPusher(molArr[0], molArr[0], \"bond3\", \"atom4\");"
    }
  ]